---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExternalService.ExternalServiceRegistry
source: html/c3803044-edf3-75a3-6f38-a3787041a852.htm
---
# ExternalServiceRegistry Members

Execute a service independently of any document.